# Obtaining Your Data - Lab

## Introduction
In this lab you'll practice your munging and transforming skills in order to load in your data to solve a regression problem.

## Objectives
You will be able to:
* Understand the ETL process and the steps it consists of
* Understand the challenges of working with data from multiple sources

## Task Description

You just got hired by Lego! Your first project is going to be to develop a pricing algorithm to help set a target price for new lego sets that are released to market. To do this, you're first going to need to start mining the company database in order to collect the information you need to develop a model.

Start by investigating the database stored in lego.db and joining the tables into a unified dataset!

> **Hint:** use this sql statement to preview the tables in an unknown database:
```sql
SELECT name FROM sqlite_master
             WHERE type='table'
             ORDER BY name;
```

In [2]:
# Your code here
import sqlite3
import pandas as pd

In [3]:
con = sqlite3.connect('lego.db')
c = con.cursor()
c.execute('''SELECT name FROM sqlite_master
             WHERE type='table'
             ORDER BY name''')
c.fetchall()

[('product_details',),
 ('product_info',),
 ('product_pricing',),
 ('product_reviews',)]

In [4]:
c.execute('''select * from product_details''')
product_details = pd.DataFrame(c.fetchall())
product_details.columns = [i[0] for i in c.description]
product_details.head()

   prod_id prod_desc prod_long_desc theme_name
0      630      blah       blahblah    Classic
1     2304      blah       blahblah     DUPLO®
2     7280      blah       blahblah       City
3     7281      blah       blahblah       City
4     7499      blah       blahblah       City

In [5]:
c.execute('''select * from product_info''')
product_info = pd.DataFrame(c.fetchall())
product_info.columns = [i[0] for i in c.description]
product_info.head()

   prod_id  ages  piece_count                         set_name
0      630    4+            1                  Brick Separator
1     2304  1½-5            1     LEGO® DUPLO® Green Baseplate
2     7280  5-12            2      Straight & Crossroad Plates
3     7281  5-12            2  T-Junction & Curved Road Plates
4     7499  5-12           24     Flexible and Straight Tracks

In [6]:
c.execute('''select * from product_pricing''')
product_pricing = pd.DataFrame(c.fetchall())
product_pricing.columns = [i[0] for i in c.description]
product_pricing.head()

   prod_id country list_price
0    75823      US      29.99
1    75822      US      19.99
2    75821      US      12.99
3    21030      US      99.99
4    21035      US      79.99

In [7]:
c.execute('''select * from product_reviews''')
product_reviews = pd.DataFrame(c.fetchall())
product_reviews.columns = [i[0] for i in c.description]
product_reviews.head()

,prod_id,num_reviews,play_star_rating,review_difficulty,star_rating,val_star_rating
0,630,180.0,4.0,Very Easy,4.8,4.6
1,2304,15.0,4.4,Easy,4.0,3.3
2,7280,85.0,4.1,Very Easy,3.5,2.3
3,7281,40.0,4.1,Very Easy,3.9,2.8
4,7499,89.0,2.9,Easy,2.5,2.2

In [8]:
c.execute('''select * from product_details pd
            join product_reviews pr
            using(prod_id)
            join product_info pi
            using(prod_id)
            join product_pricing pp
            using(prod_id)
            ''')
joined = pd.DataFrame(c.fetchall())
joined.columns = [i[0] for i in c.description]

In [9]:
joined.head()

,prod_id,prod_desc,prod_long_desc,theme_name,num_reviews,play_star_rating,review_difficulty,star_rating,val_star_rating,ages,piece_count,set_name,country,list_price
0,75823,blah,blahblah,Angry Birds™,2.0,4.0,Average,4.5,4.0,6-12,277,Bird Island Egg Heist,US,29.99
1,75822,blah,blahblah,Angry Birds™,2.0,4.0,Easy,5.0,4.0,6-12,168,Piggy Plane Attack,US,19.99
2,75821,blah,blahblah,Angry Birds™,11.0,4.3,Easy,4.3,4.1,6-12,74,Piggy Car Escape,US,12.99
3,21030,blah,blahblah,Architecture,23.0,3.6,Average,4.6,4.3,12+,1032,United States Capitol Building,US,99.99
4,21035,blah,blahblah,Architecture,14.0,3.2,Challenging,4.6,4.1,12+,744,Solomon R. Guggenheim Museum®,US,79.99

In [ ]:
joined.y

## Summary
Nice work! You're working more and more independently through the workflow and ensuring data integrity!